test/zoo/complex/ddl/complex_ddl.dbml
Table ANIMAL {
  "code espèce" VARCHAR(42) [not null]
  nom VARCHAR(42) [not null]
  "date naissance" VARCHAR(42) [not null]
  sexe VARCHAR(42)
  "date décès" VARCHAR(42)
  "code espèce mère" VARCHAR(42) [null]
  "nom mère" VARCHAR(42) [null]
  "date naissance mère" VARCHAR(42) [null]
  "type alimentation" UNSIGNED_INT [null]
  "est carnivore" BOOLEAN [not null]
  "quantité viande" VARCHAR(42) [null]
  "est herbivore" BOOLEAN [not null]
  "plante préférée" VARCHAR(42) [null]
  Indexes {
    ("code espèce", nom, "date naissance") [pk]
  }
}

Table "ESPÈCE" {
  "code espèce" VARCHAR(42) [pk, not null]
  "nom latin" VARCHAR(42)
  "nom vernaculaire" VARCHAR(42)
  Indexes {
    "nom latin" [unique]
  }
}

Table OCCUPE {
  "code espèce" VARCHAR(42) [not null]
  nom VARCHAR(42) [not null]
  "date naissance" VARCHAR(42) [not null]
  "num. enclos" VARCHAR(42) [not null]
  "date début" VARCHAR(42) [not null]
  "date fin" VARCHAR(42) [not null]
  Indexes {
    ("code espèce", nom, "date naissance", "num. enclos") [pk]
  }
}

Table "PEUT COHABITER AVEC" {
  "code espèce" VARCHAR(42) [not null]
  "code espèce commensale" VARCHAR(42) [not null]
  "nb. max. commensaux" VARCHAR(42)
  Indexes {
    ("code espèce", "code espèce commensale") [pk]
  }
}

Table "PEUT VIVRE DANS" {
  "code espèce" VARCHAR(42) [not null]
  "num. enclos" VARCHAR(42) [not null]
  "nb. max. congénères" VARCHAR(42)
  Indexes {
    ("code espèce", "num. enclos") [pk]
  }
}

Ref:ANIMAL."code espèce" > "ESPÈCE"."code espèce"
Ref:ANIMAL.("code espèce mère", "date naissance mère", "nom mère") > ANIMAL.("code espèce", "date naissance", nom)
Ref:OCCUPE.("code espèce", "date naissance", nom) > ANIMAL.("code espèce", "date naissance", nom)
Ref:"PEUT COHABITER AVEC".("code espèce", "code espèce commensale") > "ESPÈCE".("code espèce", "code espèce")
Ref:"PEUT VIVRE DANS"."code espèce" > "ESPÈCE"."code espèce"
